#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lifecycle_bucket.google_storage_bucket.gcp_bucket: Refreshing state... [id=nyc-taxi-dev-dtc-dataops-dev-366316]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.lifecycle_bucket.google_storage_bucket.gcp_bucket has changed
  ~ resource "google_storage_bucket" "gcp_bucket" {
        id                          = "nyc-taxi-dev-dtc-dataops-dev-366316"
      + labels                      = {}
        name                        = "nyc-taxi-dev-dtc-dataops-dev-366316"
        # (9 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_service_account.airflow will be created
  + resource "google_service_account" "airflow" {
      + account_id   = "airflow-dev"
      + disabled     = false
      + display_name = "airflow"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_storage_bucket_iam_member.airflow will be created
  + resource "google_storage_bucket_iam_member" "airflow" {
      + bucket = "nyc-taxi-dev-dtc-dataops-dev-366316"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.lifecycle_bucket.google_storage_bucket.gcp_bucket will be destroyed
  # (because google_storage_bucket.gcp_bucket is not in configuration)
  - resource "google_storage_bucket" "gcp_bucket" {
      - default_event_based_hold    = false -> null
      - force_destroy               = true -> null
      - id                          = "nyc-taxi-dev-dtc-dataops-dev-366316" -> null
      - labels                      = {} -> null
      - location                    = "US-WEST1" -> null
      - name                        = "nyc-taxi-dev-dtc-dataops-dev-366316" -> null
      - project                     = "dtc-dataops-dev-366316" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/nyc-taxi-dev-dtc-dataops-dev-366316" -> null
      - storage_class               = "STANDARD" -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://nyc-taxi-dev-dtc-dataops-dev-366316" -> null

      - lifecycle_rule {
          - action {
              - type = "Delete" -> null
            }

          - condition {
              - age                        = 30 -> null
              - days_since_custom_time     = 0 -> null
              - days_since_noncurrent_time = 0 -> null
              - matches_prefix             = [] -> null
              - matches_storage_class      = [] -> null
              - matches_suffix             = [] -> null
              - num_newer_versions         = 0 -> null
              - with_state                 = "ANY" -> null
            }
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.nyc_taxi_data_lake.google_storage_bucket.gcp_bucket will be created
  + resource "google_storage_bucket" "gcp_bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-WEST1"
      + name                        = "nyc-taxi-dev-dtc-dataops-dev-366316"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }

      + versioning {
          + enabled = true
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @djcurill, Action: `pull_request`*